Revit 2027 API
BuiltInFailures.SubRegionFailures.NoHostForToposolidSubregion Property
 This sub-division now does not appear to overlap any Toposolid with an appropriate Phase and Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoHostForToposolidSubregion { get; }
Public Shared ReadOnly Property NoHostForToposolidSubregion As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoHostForToposolidSubregion {
	FailureDefinitionId^ get ();
}
static member NoHostForToposolidSubregion : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SubRegionFailures Class
Autodesk.Revit.DB Namespace